/*
	1.frame 함수와 hcat함수를(전주수업에있는) 반복자를 사용하여 다시 구현하라.

	2.find_urls 함수를 확인하는 프로그램을 작성하라.

	3. 다음 코드의 동작 과정을 설명하라.
	vector<int>u(10,100);
	vecter<int>v;
	copy(u.begin(),u.end(),v.begin());

	4. u에서 v로의 복사하는 프로그램을 수정하라. 수정하는 방식은 2가지 이상이있다. 2개를 구현하고 각각의 장단점을 설명하라.

	5. 수업중 과제부분의 함수를 완성하라.

	6. 위의 함수와 같은 동작을 실행하는 함수가 2가지가 있다. 이 함수들을 하나의 함수로 합하여보아라.

	7. 모든 과제를 했는지에 따라 학생을 분류하는 부분은 extract_fails함수에서 해결한 문제와 매우 흡사하다.
		이부분을 처리하는 함수를 작성하라. 

	8. 원하는 기준에 따라 학생을 분류하는데 사용할 수 있는 단일 함수를 작성하라.
		기준은 모든숙제X 중간X 기말X 숙제중 2개 미만을 한학생등등 여러개가 될수있다. 이중 만만해 보이는것으로 골라서 해라.


*/